-- -- -- -- --
--  Блок 2  -- 
-- -- -- -- --
-- Написание SQL-запросов на примере базы данных sakila

-- 1. Выведите дни недели в порядке убывания средней стоимости суммы продаж (amount) в них (таблица payment)
-- если не делали блок 1

-- 2. Сколько копий фильма Caper Motions имеется в системе? (используйте таблицы film и inventory)

/*
3. Выведите имена, фамилии и email всех клиентов компании, проживающих в Russian Federation.
Список должен быть упорядочен по фамилиям. Имена и фамилии необходимо выводит в едином столбце "Name".
*/


-- 4. Без использования join выведите в одном столбце фамилии и имена актёров, которые снялись в фильме MASK PEACH.


/*
5. Выведите объём продаж по каждому пункту проката.
Выдаваемая таблица должна содержать id пункта проката, общий объём выручки в этом пункте, страну и город, где расположен пункт.
*/


-- 6. Перечислите пять самых прибыльных категорий фильмов в порядке убывания.


/*
7. Выведите title, description, special_features, length и rental_duration фильмов с закадровым текстом,
которые имеют продолжительность не менее 2 часов и продолжительность проката от 5 до 7 дней.
Выведите первые 10 фильмов, расположенные в порядке убывания продолжительности.
*/


-- 8. Выведите топ-7 продавцов (фамилии, имена и сумма продаж)

-- 9. Выведите топ-17 актёров, снявшихся в наибольшем количестве фильмов
